wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_flexcan.h
/*
 *******************************************************************************
    @file     reg_flexcan.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_FLEXCAN_H
#define __REG_FLEXCAN_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>


#if defined ( __CC_ARM )
#pragma anon_unions
#endif


/**
  * @brief CAN Base Address Definition
  */
#define FLEX_CAN1_BASE                       (APB1PERIPH_BASE + 0xC000)         /*!< Base Address: 0x4000C000 */


/* CAN   Typedef -----------------------------------------------------------------------------------------------------*/
typedef struct {
    __IO uint32_t MCR;                                  /*!< Module Configuration Register,                       offset: 0x00 */
    __IO uint32_t CTRL1;                                /*!< Control 1 register                                   offset: 0x04 */
    __IO uint32_t TIMER;                                /*!< Free Running Timer                                   offset: 0x08 */
    __IO uint32_t RESERVED0x0C[1];                      /*!<                                                      offset: 0x0C */
    __IO uint32_t RXMGMASK;                             /*!< Rx Mailboxes Global Mask Register                    offset: 0x10 */
    __IO uint32_t RX14MASK;                             /*!< Rx 14 Mask Register                                  offset: 0x14 */
    __IO uint32_t RX15MASK;                             /*!< Rx 15 Mask Register                                  offset: 0x18 */
    __IO uint32_t ECR;                                  /*!< Error Counter Register                               offset: 0x1C */
    __IO uint32_t ESR1;                                 /*!< Error and Status 1 Register                          offset: 0x20 */
    __IO uint32_t RESERVED0x24[1];                      /*!<                                                      offset: 0x24 */
    __IO uint32_t IMASK1;                               /*!< Interrupt Masks 1 Register,                          offset: 0x28 */
    __IO uint32_t RESERVED0x2C[1];                      /*!<                                                      offset: 0x2C */                   
    __IO uint32_t IFLAG1;                               /*!< Interrupt Flags 1 Register                           offset: 0x30 */
    __IO uint32_t CTRL2;                                /*!< Control 2 Register                                   offset: 0x34 */
    __IO uint32_t ESR2;                                 /*!< Error and Status 2 Register                          offset: 0x38 */
    __IO uint32_t RESERVED0x3C[2];                      /*!<                                                      offset: 0x3C~0x40 */                  
    __IO uint32_t CRCR;                                 /*!< CRC Register                                         offset: 0x44 */
    __IO uint32_t RXFGMASK;                             /*!< Rx FIFO Global Mask Register                         offset: 0x48 */
    __IO uint32_t RXFIR;                                /*!< Rx FIFO Information Register                         offset: 0x4C */
    __IO uint32_t CBT;                                  /*!< CAN Bit Timing Register                              offset: 0x50 */
    __IO uint32_t  RESERVED0x54[11];                    /*!<                                                      offset:0x54~0x7C */           
    struct { 
        __IO uint32_t CS;                               /*!< Message Buffer 0 CS Register                         offset: 0x80 */
        __IO uint32_t ID;                               /*!< Message Buffer 0 ID Register                         offset: 0x84 */
        __IO uint32_t WORD0;                            /*!< Message Buffer 0 WORD0 Register                      offset: 0x88 */
        __IO uint32_t WORD1;                            /*!< Message Buffer 0 WORD1 Register                      offset: 0x8C */
    } MB[32];                                           /*!<                                                      offset: 0x80~0x27C */
    __IO uint32_t RESERVED0x280[384];                   /*!<                                                      offset: 0x280~0x87C */
    __IO uint32_t RXIMR[32];                            /*!< Rx Individual Mask Registers                         offset: 0x880 */
    __IO uint32_t RESERVED0x900[192];                   /*!<                                                      offset: 0x900~0xBFC */
    __IO uint32_t FDCTRL;                               /*!< CAN FD Control Register                              offset: 0xC00 */
    __IO uint32_t FDCBT;                                /*!< CAN FD Bit Timing Register                           offset: 0xC04 */
    __IO uint32_t FDCRC;                                /*!< CAN FD CRC Register                                  offset: 0xC08 */
    __IO uint32_t ERFCR;                                /*!< Enhanced Rx FIFO Control Register                    offset: 0xC0C */
    __IO uint32_t ERFIER;                               /*!< Enhanced Rx FIFO Interrupt Enable Register           offset: 0xC10 */
    __IO uint32_t ERFSR;                                /*!< Enhanced Rx FIFO Status Register                     offset: 0xC14 */
    __IO uint32_t RESERVED0xC18[1274];                  /*!<                                                      offset: 0xC18~0x1FFC */                                    
    struct {   
        __IO uint32_t ERFCS;                            /*!< Enhanced Rx FIFO Buffer 0 CS Register                offset: 0x2000 */
        __IO uint32_t ERFDID;                           /*!< Enhanced Rx FIFO Buffer 0 ID Register                offset: 0x2004 */
        __IO uint32_t ERFDWORD[16];                     /*!< Enhanced Rx FIFO Buffer 0 WORD Register              offset: 0x2008 */
        __IO uint32_t IHOFF;                            /*!< Identifier receive filter hit indication             offset: 0x2048 */
        __IO uint32_t RESERVED0x204C[1];                /*!<                                                      offset: 0x204C */
    }ERFMB[6];                                          /*!<                                                      offset: 0x2000~0x21DC */
    __IO uint32_t RESERVED0x21E0[904];                  /*!<                                                      offset: 0x21E0~0x2FFC */                                     
    __IO uint32_t ERFFEL[2];                            /*!< Enhanced Rx FIFO Filter Element Registers (n=0 ~ 1)  offset: 0x3000 */
} Flex_CAN_TypeDef;


/**
  * @brief CAN type pointer Definition
  */
#define FLEX_CAN1                        ((Flex_CAN_TypeDef*) FLEX_CAN1_BASE)



#define IDEAL_SP_LOW    (750U)
#define IDEAL_SP_MID    (800U)
#define IDEAL_SP_HIGH   (875U)
#define IDEAL_SP_FACTOR (1000U)

/* FLEXCAN module features */

/**
 * @brief Message buffer size
 */
#define FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(x) (16)
/**
  * @brief Has doze mode support (register bit field MCR[DOZE]).
  */
#define FLEXCAN_HAS_DOZE_MODE_SUPPORT (0)
/**
  * @brief Insatnce has doze mode support (register bit field MCR[DOZE]).
  */
#define FLEXCAN_INSTANCE_HAS_DOZE_MODE_SUPPORTn(x) (0)
/**
  * @brief Has a glitch filter on the receive pin (register bit field MCR[WAKSRC]).
  */
#define FLEXCAN_HAS_GLITCH_FILTER (1)
/**
  * @brief Has extended interrupt mask and flag register (register IMASK2, IFLAG2).
  */
#define FLEXCAN_HAS_EXTENDED_FLAG_REGISTER (0)
/**
  * @brief Instance has extended bit timing register (register CBT).
  */
#define FLEXCAN_INSTANCE_HAS_EXTENDED_TIMING_REGISTERn(x) (1)
/**
  * @brief Has a receive FIFO DMA feature (register bit field MCR[DMA]).
  */
#define FLEXCAN_HAS_RX_FIFO_DMA (1)
/**
  * @brief Instance has a receive FIFO DMA feature (register bit field MCR[DMA]).
  */
#define FLEXCAN_INSTANCE_HAS_RX_FIFO_DMAn(x) (1)
/**
  * @brief Has separate message buffer 0 interrupt flag (register bit field IFLAG1[BUF0I]).
  */
#define FLEXCAN_HAS_SEPARATE_BUFFER_0_FLAG (1)
/**
  * @brief Has bitfield name BUF31TO0M.
  */
#define FLEXCAN_HAS_BUF31TO0M (1)
/**
  * @brief Number of interrupt vectors.
  */
#define FLEXCAN_INTERRUPT_COUNT (6)
/**
  * @brief Is affected by errata with ID 5641 (Module does not transmit a message that is enabled to be transmitted at a specific moment during the arbitration process).
  */
#define FLEXCAN_HAS_ERRATA_5641 (0)


