wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_flexcan.h
/** @name ERFDWORD3 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD3_DATA_BYTE_15_MASK               (0xFFU)
#define CAN_ERFDWORD3_DATA_BYTE_15_SHIFT              (0U)
#define CAN_ERFDWORD3_DATA_BYTE_15(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD3_DATA_BYTE_15_SHIFT)) & CAN_ERFDWORD3_DATA_BYTE_15_MASK)
#define CAN_ERFDWORD3_DATA_BYTE_14_MASK               (0xFF00U)                                                                 
#define CAN_ERFDWORD3_DATA_BYTE_14_SHIFT              (8U)                                                                      
#define CAN_ERFDWORD3_DATA_BYTE_14(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD3_DATA_BYTE_14_SHIFT)) & CAN_ERFDWORD3_DATA_BYTE_14_MASK)
#define CAN_ERFDWORD3_DATA_BYTE_13_MASK               (0xFF0000U)                                                           
#define CAN_ERFDWORD3_DATA_BYTE_13_SHIFT              (16U)                                                                 
#define CAN_ERFDWORD3_DATA_BYTE_13(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD3_DATA_BYTE_13_SHIFT)) & CAN_ERFDWORD3_DATA_BYTE_13_MASK)
#define CAN_ERFDWORD3_DATA_BYTE_12_MASK               (0xFF000000U)                              
#define CAN_ERFDWORD3_DATA_BYTE_12_SHIFT              (24U)                                      
#define CAN_ERFDWORD3_DATA_BYTE_12(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD3_DATA_BYTE_12_SHIFT)) & CAN_ERFDWORD3_DATA_BYTE_12_MASK)

/**
  * @}
  */

/** @name ERFDWORD4 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD4_DATA_BYTE_19_MASK               (0xFFU)
#define CAN_ERFDWORD4_DATA_BYTE_19_SHIFT              (0U)
#define CAN_ERFDWORD4_DATA_BYTE_19(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD4_DATA_BYTE_19_SHIFT)) & CAN_ERFDWORD4_DATA_BYTE_19_MASK)
#define CAN_ERFDWORD4_DATA_BYTE_18_MASK               (0xFF00U)                                  
#define CAN_ERFDWORD4_DATA_BYTE_18_SHIFT              (8U)                                       
#define CAN_ERFDWORD4_DATA_BYTE_18(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD4_DATA_BYTE_18_SHIFT)) & CAN_ERFDWORD4_DATA_BYTE_18_MASK)
#define CAN_ERFDWORD4_DATA_BYTE_17_MASK               (0xFF0000U)                               
#define CAN_ERFDWORD4_DATA_BYTE_17_SHIFT              (16U)                                     
#define CAN_ERFDWORD4_DATA_BYTE_17(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD4_DATA_BYTE_17_SHIFT)) & CAN_ERFDWORD4_DATA_BYTE_17_MASK)
#define CAN_ERFDWORD4_DATA_BYTE_16_MASK               (0xFF000000U)                            
#define CAN_ERFDWORD4_DATA_BYTE_16_SHIFT              (24U)                                    
#define CAN_ERFDWORD4_DATA_BYTE_16(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD4_DATA_BYTE_16_SHIFT)) & CAN_ERFDWORD4_DATA_BYTE_16_MASK)

/**
  * @}
  */

/** @name ERFDWORD5 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD5_DATA_BYTE_23_MASK               (0xFFU)
#define CAN_ERFDWORD5_DATA_BYTE_23_SHIFT              (0U)
#define CAN_ERFDWORD5_DATA_BYTE_23(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD5_DATA_BYTE_23_SHIFT)) & CAN_ERFDWORD5_DATA_BYTE_23_MASK)
#define CAN_ERFDWORD5_DATA_BYTE_22_MASK               (0xFF00U)                                 
#define CAN_ERFDWORD5_DATA_BYTE_22_SHIFT              (8U)                                      
#define CAN_ERFDWORD5_DATA_BYTE_22(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD5_DATA_BYTE_22_SHIFT)) & CAN_ERFDWORD5_DATA_BYTE_22_MASK)
#define CAN_ERFDWORD5_DATA_BYTE_21_MASK               (0xFF0000U)                                
#define CAN_ERFDWORD5_DATA_BYTE_21_SHIFT              (16U)                                      
#define CAN_ERFDWORD5_DATA_BYTE_21(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD5_DATA_BYTE_21_SHIFT)) & CAN_ERFDWORD5_DATA_BYTE_21_MASK)
#define CAN_ERFDWORD5_DATA_BYTE_20_MASK               (0xFF000000U)                             
#define CAN_ERFDWORD5_DATA_BYTE_20_SHIFT              (24U)                                     
#define CAN_ERFDWORD5_DATA_BYTE_20(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD5_DATA_BYTE_20_SHIFT)) & CAN_ERFDWORD5_DATA_BYTE_20_MASK)

/**
  * @}
  */

/** @name ERFDWORD6 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD6_DATA_BYTE_27_MASK               (0xFFU)
#define CAN_ERFDWORD6_DATA_BYTE_27_SHIFT              (0U)
#define CAN_ERFDWORD6_DATA_BYTE_27(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD6_DATA_BYTE_27_SHIFT)) & CAN_ERFDWORD6_DATA_BYTE_27_MASK)
#define CAN_ERFDWORD6_DATA_BYTE_26_MASK               (0xFF00U)                                  
#define CAN_ERFDWORD6_DATA_BYTE_26_SHIFT              (8U)                                       
#define CAN_ERFDWORD6_DATA_BYTE_26(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD6_DATA_BYTE_26_SHIFT)) & CAN_ERFDWORD6_DATA_BYTE_26_MASK)
#define CAN_ERFDWORD6_DATA_BYTE_25_MASK               (0xFF0000U)                               
#define CAN_ERFDWORD6_DATA_BYTE_25_SHIFT              (16U)                                     
#define CAN_ERFDWORD6_DATA_BYTE_25(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD6_DATA_BYTE_25_SHIFT)) & CAN_ERFDWORD6_DATA_BYTE_25_MASK)
#define CAN_ERFDWORD6_DATA_BYTE_24_MASK               (0xFF000000U)                            
#define CAN_ERFDWORD6_DATA_BYTE_24_SHIFT              (24U)                                    
#define CAN_ERFDWORD6_DATA_BYTE_24(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD6_DATA_BYTE_24_SHIFT)) & CAN_ERFDWORD6_DATA_BYTE_24_MASK)

/**
  * @}
  */

/** @name ERFDWORD7 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD7_DATA_BYTE_31_MASK               (0xFFU)
#define CAN_ERFDWORD7_DATA_BYTE_31_SHIFT              (0U)
#define CAN_ERFDWORD7_DATA_BYTE_31(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD7_DATA_BYTE_31_SHIFT)) & CAN_ERFDWORD7_DATA_BYTE_31_MASK)
#define CAN_ERFDWORD7_DATA_BYTE_30_MASK               (0xFF00U)                                   
#define CAN_ERFDWORD7_DATA_BYTE_30_SHIFT              (8U)                                        
#define CAN_ERFDWORD7_DATA_BYTE_30(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD7_DATA_BYTE_30_SHIFT)) & CAN_ERFDWORD7_DATA_BYTE_30_MASK)
#define CAN_ERFDWORD7_DATA_BYTE_29_MASK               (0xFF0000U)                               
#define CAN_ERFDWORD7_DATA_BYTE_29_SHIFT              (16U)                                     
#define CAN_ERFDWORD7_DATA_BYTE_29(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD7_DATA_BYTE_29_SHIFT)) & CAN_ERFDWORD7_DATA_BYTE_29_MASK)
#define CAN_ERFDWORD7_DATA_BYTE_28_MASK               (0xFF000000U)                               
#define CAN_ERFDWORD7_DATA_BYTE_28_SHIFT              (24U)                                       
#define CAN_ERFDWORD7_DATA_BYTE_28(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD7_DATA_BYTE_28_SHIFT)) & CAN_ERFDWORD7_DATA_BYTE_28_MASK)

/**
  * @}
  */

/** @name ERFDWORD8 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD8_DATA_BYTE_35_MASK               (0xFFU)
#define CAN_ERFDWORD8_DATA_BYTE_35_SHIFT              (0U)
#define CAN_ERFDWORD8_DATA_BYTE_35(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_35_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_35_MASK)
#define CAN_ERFDWORD8_DATA_BYTE_34_MASK               (0xFF00U)                                  
#define CAN_ERFDWORD8_DATA_BYTE_34_SHIFT              (8U)                                       
#define CAN_ERFDWORD8_DATA_BYTE_34(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_34_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_34_MASK)
#define CAN_ERFDWORD8_DATA_BYTE_33_MASK               (0xFF0000U)                                
#define CAN_ERFDWORD8_DATA_BYTE_33_SHIFT              (16U)                                      
#define CAN_ERFDWORD8_DATA_BYTE_33(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_33_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_33_MASK)
#define CAN_ERFDWORD8_DATA_BYTE_32_MASK               (0xFF000000U)                              
#define CAN_ERFDWORD8_DATA_BYTE_32_SHIFT              (24U)                                      
#define CAN_ERFDWORD8_DATA_BYTE_32(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_32_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_32_MASK)

/**
  * @}
  */

/** @name ERFDWORD9 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD9_DATA_BYTE_39_MASK               (0xFFU)
#define CAN_ERFDWORD9_DATA_BYTE_39_SHIFT              (0U)
#define CAN_ERFDWORD9_DATA_BYTE_39(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_39_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_39_MASK)
#define CAN_ERFDWORD9_DATA_BYTE_38_MASK               (0xFF00U)                            
#define CAN_ERFDWORD9_DATA_BYTE_38_SHIFT              (8U)                                 
#define CAN_ERFDWORD9_DATA_BYTE_38(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_38_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_38_MASK)
#define CAN_ERFDWORD9_DATA_BYTE_37_MASK               (0xFF0000U)                               
#define CAN_ERFDWORD9_DATA_BYTE_37_SHIFT              (16U)                                     
#define CAN_ERFDWORD9_DATA_BYTE_37(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_37_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_37_MASK)
#define CAN_ERFDWORD9_DATA_BYTE_36_MASK               (0xFF000000U)                             
#define CAN_ERFDWORD9_DATA_BYTE_36_SHIFT              (24U)                                     
#define CAN_ERFDWORD9_DATA_BYTE_36(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD9_DATA_BYTE_36_SHIFT)) & CAN_ERFDWORD9_DATA_BYTE_36_MASK)

/**
  * @}
  */

/** @name ERFDWORD10 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD10_DATA_BYTE_43_MASK               (0xFFU)
#define CAN_ERFDWORD10_DATA_BYTE_43_SHIFT              (0U)
#define CAN_ERFDWORD10_DATA_BYTE_43(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD10_DATA_BYTE_43_SHIFT)) & CAN_ERFDWORD10_DATA_BYTE_43_MASK)
#define CAN_ERFDWORD10_DATA_BYTE_42_MASK               (0xFF00U)                                 
#define CAN_ERFDWORD10_DATA_BYTE_42_SHIFT              (8U)                                      
#define CAN_ERFDWORD10_DATA_BYTE_42(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD10_DATA_BYTE_42_SHIFT)) & CAN_ERFDWORD10_DATA_BYTE_42_MASK)
#define CAN_ERFDWORD10_DATA_BYTE_41_MASK               (0xFF0000U)                                 
#define CAN_ERFDWORD10_DATA_BYTE_41_SHIFT              (16U)                                       
#define CAN_ERFDWORD10_DATA_BYTE_41(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD10_DATA_BYTE_41_SHIFT)) & CAN_ERFDWORD10_DATA_BYTE_41_MASK)
#define CAN_ERFDWORD10_DATA_BYTE_40_MASK               (0xFF000000U)                             
#define CAN_ERFDWORD10_DATA_BYTE_40_SHIFT              (24U)                                     
#define CAN_ERFDWORD10_DATA_BYTE_40(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD10_DATA_BYTE_40_SHIFT)) & CAN_ERFDWORD10_DATA_BYTE_40_MASK)

/**
  * @}
  */

/** @name ERFDWORD11 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD11_DATA_BYTE_47_MASK               (0xFFU)
#define CAN_ERFDWORD11_DATA_BYTE_47_SHIFT              (0U)
#define CAN_ERFDWORD11_DATA_BYTE_47(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD11_DATA_BYTE_47_SHIFT)) & CAN_ERFDWORD11_DATA_BYTE_47_MASK)
#define CAN_ERFDWORD11_DATA_BYTE_46_MASK               (0xFF00U)                                  
#define CAN_ERFDWORD11_DATA_BYTE_46_SHIFT              (8U)                                       
#define CAN_ERFDWORD11_DATA_BYTE_46(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD11_DATA_BYTE_46_SHIFT)) & CAN_ERFDWORD11_DATA_BYTE_46_MASK)
#define CAN_ERFDWORD11_DATA_BYTE_45_MASK               (0xFF0000U)                               
#define CAN_ERFDWORD11_DATA_BYTE_45_SHIFT              (16U)                                     
#define CAN_ERFDWORD11_DATA_BYTE_45(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD11_DATA_BYTE_45_SHIFT)) & CAN_ERFDWORD11_DATA_BYTE_45_MASK)
#define CAN_ERFDWORD11_DATA_BYTE_44_MASK               (0xFF000000U)                           
#define CAN_ERFDWORD11_DATA_BYTE_44_SHIFT              (24U)                                   
#define CAN_ERFDWORD11_DATA_BYTE_44(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD11_DATA_BYTE_44_SHIFT)) & CAN_ERFDWORD11_DATA_BYTE_44_MASK)

/**
  * @}
  */

/** @name ERFDWORD12 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD12_DATA_BYTE_51_MASK               (0xFFU)
#define CAN_ERFDWORD12_DATA_BYTE_51_SHIFT              (0U)
#define CAN_ERFDWORD12_DATA_BYTE_51(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD12_DATA_BYTE_51_SHIFT)) & CAN_ERFDWORD12_DATA_BYTE_51_MASK)
#define CAN_ERFDWORD12_DATA_BYTE_50_MASK               (0xFF00U)                                   
#define CAN_ERFDWORD12_DATA_BYTE_50_SHIFT              (8U)                                        
#define CAN_ERFDWORD12_DATA_BYTE_50(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD12_DATA_BYTE_50_SHIFT)) & CAN_ERFDWORD12_DATA_BYTE_50_MASK)
#define CAN_ERFDWORD12_DATA_BYTE_49_MASK               (0xFF0000U)                                  
#define CAN_ERFDWORD12_DATA_BYTE_49_SHIFT              (16U)                                        
#define CAN_ERFDWORD12_DATA_BYTE_49(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD12_DATA_BYTE_49_SHIFT)) & CAN_ERFDWORD12_DATA_BYTE_49_MASK)
#define CAN_ERFDWORD12_DATA_BYTE_48_MASK               (0xFF000000U)                                
#define CAN_ERFDWORD12_DATA_BYTE_48_SHIFT              (24U)                                        
#define CAN_ERFDWORD12_DATA_BYTE_48(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD12_DATA_BYTE_48_SHIFT)) & CAN_ERFDWORD12_DATA_BYTE_48_MASK)

/**
  * @}
  */

